Ran Plan for 2 projects:

1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
1. project: `development` dir: `deployment/dev/terraform` workspace: `default`

### 1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.google_client_config.current: Reading...
data.google_client_config.current: Read complete after 0s [id=projects/"bits-backstage-prod"/regions/"us-east4"/zones/<null>]
data.google_project.current: Reading...
data.google_project.current: Read complete after 1s [id=projects/bits-backstage-prod]
module.postgres.data.google_compute_zones.available[0]: Reading...
module.postgres.data.google_compute_zones.available[0]: Read complete after 0s [id=projects/bits-backstage-prod/regions/us-east4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_project_iam_member.sa_access will be created
+ resource "google_project_iam_member" "sa_access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull-sa@broadinstitute.org"
+       project = "bits-backstage-prod"
+       role    = "roles/owner"
    }

  # google_project_iam_member.team_access will be created
+ resource "google_project_iam_member" "team_access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull@broadinstitute.org"
+       project = "bits-backstage-prod"
+       role    = "roles/editor"
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-github-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-github-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-github-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-github-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-google-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-google-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-google-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-google-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["github-app-backstage-bits-credentials"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "github-app-backstage-bits-credentials"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_service_account_iam_member.db_workload_identity will be created
+ resource "google_service_account_iam_member" "db_workload_identity" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "serviceAccount:bits-gke-clusters.svc.id.goog[backstage/backstage]"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

  # postgresql_grant.database_connect["backstage"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.client"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/cloudsql.client"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.instanceUser"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/cloudsql.instanceUser"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/iam.serviceAccountTokenCreator"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.metricWriter"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.viewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/monitoring.viewer"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/secretmanager.secretAccessor"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # module.db_service_accounts.google_service_account.service_accounts["backstage"] will be created
+ resource "google_service_account" "service_accounts" {
+       account_id   = "backstage"
+       description  = "service account for backstage"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "bits-backstage-prod"
+       unique_id    = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_app"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_app"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_auth"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_auth"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_catalog"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_catalog"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_scaffolder"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_scaffolder"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_search"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_search"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.default[0] will be created
+ resource "google_sql_database" "default" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database_instance.default will be created
+ resource "google_sql_database_instance" "default" {
+       available_maintenance_versions = (known after apply)
+       connection_name                = (known after apply)
+       database_version               = "POSTGRES_15"
+       deletion_protection            = false
+       dns_name                       = (known after apply)
+       encryption_key_name            = (known after apply)
+       first_ip_address               = (known after apply)
+       id                             = (known after apply)
+       instance_type                  = (known after apply)
+       ip_address                     = (known after apply)
+       maintenance_version            = (known after apply)
+       master_instance_name           = (known after apply)
+       name                           = "backstage-prod"
+       private_ip_address             = (known after apply)
+       project                        = "bits-backstage-prod"
+       psc_service_attachment_link    = (known after apply)
+       public_ip_address              = (known after apply)
+       region                         = "us-east4"
+       self_link                      = (known after apply)
+       server_ca_cert                 = (sensitive value)
+       service_account_email_address  = (known after apply)

+       settings {
+           activation_policy           = "ALWAYS"
+           availability_type           = "ZONAL"
+           connector_enforcement       = "NOT_REQUIRED"
+           deletion_protection_enabled = false
+           disk_autoresize             = true
+           disk_autoresize_limit       = 0
+           disk_size                   = 10
+           disk_type                   = "PD_SSD"
+           edition                     = "ENTERPRISE"
+           pricing_plan                = "PER_USE"
+           tier                        = "db-custom-8-32768"
+           user_labels                 = (known after apply)
+           version                     = (known after apply)

+           backup_configuration {
+               enabled                        = false
+               point_in_time_recovery_enabled = false
+               start_time                     = (known after apply)
+               transaction_log_retention_days = (known after apply)
            }

+           database_flags {
+               name  = "cloudsql.iam_authentication"
+               value = "on"
            }

+           ip_configuration {
+               enable_private_path_for_google_cloud_services = false
+               ipv4_enabled                                  = true
+               require_ssl                                   = true
+               ssl_mode                                      = (known after apply)
            }

+           maintenance_window {
+               day          = 1
+               hour         = 23
+               update_track = "canary"
            }
        }

+       timeouts {
+           create = "30m"
+           delete = "30m"
+           update = "30m"
        }
    }

  # module.postgres.google_sql_user.default[0] will be created
+ resource "google_sql_user" "default" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-prod"
+       name                    = "backstage"
+       password                = (sensitive value)
+       project                 = "bits-backstage-prod"
+       sql_server_user_details = (known after apply)
    }

  # module.postgres.google_sql_user.iam_account["backstage"] will be created
+ resource "google_sql_user" "iam_account" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-prod"
+       name                    = (known after apply)
+       project                 = "bits-backstage-prod"
+       sql_server_user_details = (known after apply)
+       type                    = (known after apply)
    }

  # module.postgres.null_resource.module_depends_on will be created
+ resource "null_resource" "module_depends_on" {
+       id       = (known after apply)
+       triggers = {
+           "value" = "0"
        }
    }

  # module.postgres.random_password.user-password will be created
+ resource "random_password" "user-password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       keepers     = {
+           "name" = "backstage-prod"
        }
+       length      = 32
+       lower       = true
+       min_lower   = 1
+       min_numeric = 1
+       min_special = 0
+       min_upper   = 1
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

Plan: 50 to add, 0 to change, 0 to destroy.
╷
│ Warning: Quoted references are deprecated
│ 
│   on database.tf line 85, in resource "postgresql_grant" "select":
│   85:   depends_on = ["module.postgres"]
│ 
│ In this context, references are expected literally rather than in quotes.
│ Terraform 0.11 and earlier required quotes, but quoted references are now
│ deprecated and will be removed in a future version of Terraform. Remove the
│ quotes surrounding this reference to silence this warning.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p production`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fprod%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p production`
</details>
Plan: 50 to add, 0 to change, 0 to destroy.

---
### 2. project: `development` dir: `deployment/dev/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
        id                             = "backstage-dev"
        name                           = "backstage-dev"
        # (14 unchanged attributes hidden)

!       settings {
!           version                     = 18 -> 21
            # (12 unchanged attributes hidden)

+           database_flags {
+               name  = "max_connections"
+               value = "49"
            }

+           insights_config {
+               query_insights_enabled  = false
+               query_plans_per_minute  = 0
+               query_string_length     = 0
+               record_application_tags = false
+               record_client_address   = false
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place

Terraform will perform the following actions:

  # postgresql_grant.select["backstage"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # module.postgres.google_sql_database_instance.default will be updated in-place
! resource "google_sql_database_instance" "default" {
        id                             = "backstage-dev"
        name                           = "backstage-dev"
        # (14 unchanged attributes hidden)

!       settings {
!           tier                        = "db-f1-micro" -> "db-g1-small"
            # (12 unchanged attributes hidden)

-           database_flags {
-               name  = "max_connections" -> null
-               value = "49" -> null
            }

-           insights_config {
-               query_insights_enabled  = false -> null
-               query_plans_per_minute  = 0 -> null
-               query_string_length     = 0 -> null
-               record_application_tags = false -> null
-               record_client_address   = false -> null
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
- test = [
-       "backstage",
-       "backstage_plugin_app",
-       "backstage_plugin_auth",
-       "backstage_plugin_catalog",
-       "backstage_plugin_scaffolder",
-       "backstage_plugin_search",
    ] -> null
╷
│ Warning: Quoted references are deprecated
│ 
│   on database.tf line 85, in resource "postgresql_grant" "select":
│   85:   depends_on = ["module.postgres"]
│ 
│ In this context, references are expected literally rather than in quotes.
│ Terraform 0.11 and earlier required quotes, but quoted references are now
│ deprecated and will be removed in a future version of Terraform. Remove the
│ quotes surrounding this reference to silence this warning.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p development`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fdev%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p development`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 6 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`